# school_dict = {
#     '1а': 23,
#     '1б': 32,
#     '2б': 27
# }
#
# # a в одном из классов изменилось количество учащихся
# school_dict['2б'] = 12

# # б) в школе появился новый класс
# school_dict['2д'] = None
#
# # с) в школе был расформирован (удален) другой класс
# school_dict.pop('1б')

# Вычислите общее количество учащихся в школе.
# s = 0
# for f in school_dict.values():
#     s = s + f
#
# print(f'Кол-во детей во всей школе составляет {s}')
